tsung_example_simple2_multiple_http.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice">
<!-- ======================================================================= -->
<clients>
	<client host="localhost" use_controller_vm="true" maxusers="3000"  weight="1"/>
</clients>


<!-- ======================================================================= -->
<servers>
		<server host="localhost" port="11080" type="tcp" weight="4" />
</servers>



<!-- ======================================================================= -->
<load loop="0">
	<arrivalphase phase="1" duration="18" unit="second">
		<users				  arrivalrate="2" unit="second"/>
		<session_setup name="simpleHTTP"	probability="90"/>
		<session_setup name="unkownURL"		probability="10"/>
	</arrivalphase>
</load>



<!-- ======================================================================= -->
<sessions>
	<session name="simpleHTTP" probability="0" type="ts_http">
		<request><http url="/"				method="GET"/></request>
		<request><http url="/test_me1.php"	method="GET"/></request>
	</session>
	<session name="unkownURL" probability="0" type="ts_http">
		<request><http url="/asdfjkl"	method="GET"/></request>
	</session>
</sessions>

</tsung>