tsung_example_simple6_request_statements.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice">
<!-- ======================================================================= -->
<clients>
	<client host="localhost" use_controller_vm="true" maxusers="3000"  weight="1"/>
</clients>


<!-- ======================================================================= -->
<servers>
		<server host="localhost" port="11080" type="tcp" weight="4" />
     	<server host="localhost" port="11443" type="ssl" weight="1" /> 
</servers>



<!-- ======================================================================= -->
<load loop="0">
	<arrivalphase phase="1" duration="19" unit="second">
		<users				  arrivalrate="3" unit="second"/>
		<session_setup name="simpleHTTP"	probability="10"/>
		<session_setup name="advancedHTTP"	probability="80"/>
		<session_setup name="unkownURL"		probability="10"/>
	</arrivalphase>
</load>


<!-- ======================================================================= -->
<options>
	<option type="ts_http" name="user_agent">
		<user_agent probability="01">tsung</user_agent>
		<user_agent probability="19">Mozilla/5.0 (Windows; U; Windows NT 6.1; en-US) AppleWebKit/532.0 (KHTML, like Gecko) Chrome/4.0.201.1 Safari/532.0</user_agent>
		<user_agent probability="30">Mozilla/5.0 (Windows NT 10.0; WOW64; rv:40.0) Gecko/20100101 Firefox/40.0</user_agent>
		<user_agent probability="40">Mozilla/5.0 (IE 11.0; Windows NT 6.3; Trident/7.0; .NET4.0E; .NET4.0C; rv:11.0) like Gecko</user_agent>
		<user_agent probability="10">Mozilla/5.0 (Macintosh; Intel Mac OS X 10.12; rv:57.0) Gecko/20100101 Firefox/57.0</user_agent>
	</option>
</options>


<!-- ======================================================================= -->
<sessions>
	<session name="simpleHTTP" probability="0" type="ts_http">
		<request><http	url="/"				method="GET"/></request>
		<request><http url="/test_me1.php"	method="GET"/></request>
	</session>
	<!-- =================================================================== -->
	<session name="advancedHTTP" probability="0" type="ts_http">
		<request> <http url="/" method="GET"  version="1.0" ></http></request>
		<request>
			<http url="/" method="GET"  version="1.1" >
				<www_authenticate userid="Aladdin" passwd="open sesame" />
				<http_header name="Accept"				value="text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8" />
    			<http_header name="Cache-Control"		value="no-cache" />
				<http_header name="Referer"				value="http://www.spiegel.de/" />
				<http_header name="Accept-Encoding"		value="gzip" />
				<http_header name="Accept-Language"		value="de-DE,de;q=0.8,en-US;q=0.5,en;q=0.3" />
				<http_header name="DNT"					value="1" />
			</http>
		</request>
		<request> <http url="/" method="POST" version="1.1" contents="testkey=testvalue"> </http></request>
	</session>
	<!-- =================================================================== -->
	<session name="unkownURL" probability="0" type="ts_http">
		<thinktime value="%%_rndthink%%" random="true"></thinktime>
		<request><http url="/asdfjkl"	method="GET"/></request>
	</session>
</sessions>

</tsung>